/*
*********************************************************************************************************
* HeadFile
*********************************************************************************************************
*/

#include "infrared.h"

/*
*********************************************************************************************************
* Volatile
*********************************************************************************************************
*/

volatile uint8_t infrared_state = 0;
volatile uint32_t infrared_receive = 0;
volatile uint8_t infrared_cnt = 0;

/*
*********************************************************************************************************
* 功  能：Infrared初始化
* 形  参：None
* 返回值：None
* 备  注：Infrared - XX
* 作  者：LG
* 日  期：2020/11/24
*********************************************************************************************************
*/

void Infrared_Init(void)
{
	XX
}

/*
*********************************************************************************************************
* 功  能：中断服务函数
* 形  参：None
* 返回值：None
* 备  注：None
* 作  者：LG
* 日  期：2020/11/24
*********************************************************************************************************
*/

void XX(void)
{
	if(INTF0 & 0x1<<4)
	{
	    INTF0 &= ~(0x1<<4);                                                      /* 清除T13中断标志    */
	    t13_time==1000 ? (t13_time=0,infrared_cnt=0) : t13_time++;
	}

	if(INTF3 & 0x1<<2)
	{
		INTF3 &= ~(0x1<<2);                                                      /* 清除PTNT4中断标志  */

		if(t13_time > 350)
		{
			if(infrared_state & 0x80)                                            /* 接收到了引导码     */
			{
                infrared_state |= 0x1<<6;	                                     /* 标记信息采集完成   */
			    infrared_state &= ~(0x1<<7);
			}
		}

		if(INTC0 & 0x1<<4)                                                       /* 上升沿捕获         */
		{
			INTC0 &= ~(0x1<<4);                                                  /* 切换为下降沿捕获   */
			t13_time = 0;                                                        /* 清零计数器         */
			infrared_state |= 0x10;                                              /* 标记上升沿已捕获   */			
		}
		else                                                                     /* 下降沿捕获         */
		{
			INTC0 |= 0x1<<4;                                                     /* 切换为上升沿捕获   */
			if(infrared_state & 0x10)                                            /* 已捕获上升沿       */
			{
				if(infrared_state & 0x80)                                        /* 接收到了引导码     */
				{
					if(t13_time>3 && t13_time<8)
					{
						infrared_receive <<= 1;					                 /* 左移一位           */
						infrared_receive &= ~(0x1<<0);					         /* 接收到0            */
					}
					else if(t13_time>14 && t13_time<18)
					{
						infrared_receive <<= 1;					                 /* 左移一位           */
						infrared_receive |= 0x1<<0;					             /* 接收到1            */
					}
				}
				else if(t13_time>42 && t13_time<47)		                         /* 4.5ms              */
				{
					infrared_state |= 0x1<<7;					                 /* 引导码接收标记     */
				}
				else if(t13_time>20 && t13_time<25)		                         /* 连发码             */
				{
					infrared_cnt++;
				}
			}				
			infrared_state &= ~(0x1<<4);
			t13_time = 0;
		}		                                            
	}
}

/*
*********************************************************************************************************
* 功  能：Infrared解码
* 形  参：None
* 返回值：None
* 备  注：None
* 作  者：LG
* 日  期：2020/11/24
*********************************************************************************************************
*/

uint8_t Infrared_Decode(void)
{
    static uint8_t cache = 0;
	uint8_t key_value = 0xff;      
    uint8_t t1=0, t2=0;
	  
	if(infrared_state & 0x1<<6)
	{ 
	    t1 = infrared_receive>>24;			                                     /* 地址码             */
	    t2 = (infrared_receive>>16) & 0xff;	                                     /* 地址反码           */
 	    if((t1==(uint8)~t2) && t1==INFRARED_ID)                                  /* 校验地址码         */  
	    { 
	        t1 = infrared_receive>>8;                                            /* 控制码             */
	        t2 = infrared_receive;                                               /* 控制反码           */	
	        if(t1==(uint8)~t2)                                                   /* 校验控制码         */                                                   
			{
				key_value = t1;
				cache = key_value;
				infrared_receive = 0;
			}
		}
	}

	if(infrared_cnt > 5)                                                    
	{
		infrared_cnt--;
		key_value = cache+1;
	}
		  
    return key_value;
}
