#ifndef _PID_H_
#define _PID_H_

/*
*********************************************************************************************************
* HeadFile
*********************************************************************************************************
*/

#include "XX.h"

/*
*********************************************************************************************************
* Typedef
*********************************************************************************************************
*/

typedef struct
{
	float set;                                                                   /* 设定值             */
	float actual;	                                                             /* 实际值             */
	float err;			                                                         /* 当前误差           */
	float err1;                                                                  /* 上次误差           */
	float kp, ki, kd;	                                                         /* P, I, D 系数       */
	float out;	                                                                 /* 输出值             */
	float integral;                                                              /* 积分值             */
}PID_LOCATION;

typedef struct
{
    float set;                                                                   /* 设定值             */
    float actual;                                                                /* 实际值             */
    float err;                                                                   /* 当前误差           */
    float err1;                                                                  /* 上次误差           */
    float err2;                                                                  /* 上上次误差         */
    float kp, ki, kd;                                                            /* P, I, D 系数       */
    float out;                                                                   /* 输出值             */
}PID_INCREMENT;

/*
*********************************************************************************************************
* Extern
*********************************************************************************************************
*/

extern PID_LOCATION pid_loc;
extern PID_INCREMENT pid_inc;

/*
*********************************************************************************************************
* Function
*********************************************************************************************************
*/

void Pid_Loc_Init(void);
void Pid_Location(float set, float actual);

void Pid_Inc_Init(void);
void Pid_Increment(float set, float actual);

#endif

