/*
*********************************************************************************************************
* HeadFile
*********************************************************************************************************
*/

#include "iic.h"

/*
*********************************************************************************************************
* 功  能：延时微妙
* 形  参：几微秒
* 返回值：None
* 备  注：None
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

static void Delay_Us(uint8_t us)
{
	while(--us);
}

/*
*********************************************************************************************************
* 功  能：IIC引脚初始化
* 形  参：None
* 返回值：None
* 备  注：SCK - GPIOA0 配置为推挽输出
*	      SDA - GPIOA1 配置为开漏输出
*         空闲状态全为高电平 
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

void Iic_Pin_Init(void)
{
	XX
}

/*
*********************************************************************************************************
* 功  能：IIC起始信号
* 形  参：None
* 返回值：None
* 备  注：时钟线在高电平期间，数据线由高到低
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

void Iic_Start(void)
{
	IIC_SCK_W_1;
	IIC_SDA_W_1;
	Delay_Us(2);
	IIC_SDA_W_0;
	Delay_Us(1);
	IIC_SCK_W_0; 
}

/*
*********************************************************************************************************
* 功  能：IIC停止信号
* 形  参：None
* 返回值：None
* 备  注：时钟线在高电平期间，数据线由低到高
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

void Iic_Stop(void)
{
	IIC_SDA_W_0;
	IIC_SCK = 1;
	Delay_Us(1);
	IIC_SDA_W_1;
	Delay_Us(2);
}

/*
*********************************************************************************************************
* 功  能：主机给从机发送应答信号
* 形  参：0：应答
*		  1：非应答
* 返回值：None
* 备  注：主机每发送一帧数据，需要发送一次应答信号，最后一次不需要应答
*		  低电平为应答信号，高电平为非应答信号
*		  时钟线为低电平期间，准备数据，高电平期间，采集数据
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

static void Iic_Send_Ack(uint8_t ack)
{
	IIC_SCK_W_0;                                                                 /* 主机准备数据       */
	if(ack == 1)
		IIC_SDA_W_1;
	else
		IIC_SDA_W_0;
	Delay_Us(2);
	IIC_SCK_W_1;                                                                 /* 从机采集数据       */
	Delay_Us(1);

	IIC_SCK_W_0;                                                                 /* 为下一步操作做准备 */
}

/*
*********************************************************************************************************
* 功  能：主机读取从机发来的应答信号
* 形  参：None
* 返回值：0：应答
*		  1：非应答
* 备  注：None
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

static uint8_t Iic_Get_Ack(void)
{
	uint8_t ack = 0;
	
	IIC_SCK_W_0;                                                                 /* 从机准备数据       */
	IIC_SDA_W_1;                                                                 /* 读模式             */
	Delay_Us(2);      
	IIC_SCK_W_1;                                                                 /* 主机采集数据       */
	if(IIC_SDA_R == 1)
		ack = 1;
	else
		ack = 0;
	IIC_SCK_W_0;                                                                 /* 为下一步操作做准备 */
	
	return ack;
}

/*
*********************************************************************************************************
* 功  能：主机发送一帧数据
* 形  参：None
* 返回值：0：收到从机应答
*		  1：收到从机非应答
* 备  注：None
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

uint8_t Iic_Send_Byte(uint8_t data)
{
	uint8_t i = 0;
	
	for(i=0; i<8; i++)
	{
		IIC_SCK_W_0;                                                             /* 主机准备数据       */
		if(data & 0x80)
			IIC_SDA_W_1;
		else
			IIC_SDA_W_0;
		Delay_Us(2);                                                             /*  保持数据稳定      */
		IIC_SCK_W_1;                                                             /* 从机采集数据       */
		Delay_Us(1);                                                             /* 给从机采集数据时间 */
		data <<= 1;                                                              /* 让次高位变最高位   */
	}
	IIC_SCK = 0;                                                                 /* 为下一步操作做准备 */
	
	return Iic_Get_Ack(); 
}

/*
*********************************************************************************************************
* 功  能：主机读取一帧数据
* 形  参：待发送的应答信号
* 返回值：收到从机发来的数据
* 备  注：None
* 作  者：LG
* 日  期：2020/11/12
*********************************************************************************************************
*/

uint8_t Iic_Read_Byte(uint8_t ack)
{
	uint8_t data = 0;
	uint8_t i = 0;
	
	for(i=0; i<8; i++)
	{
		IIC_SCK_W_0;                                                             /* 从机准备数据       */
		IIC_SDA_W_1;                                                             /* 读模式             */
		Delay_Us(1);                                                             /* 保持数据稳定       */
		IIC_SCK_W_1;                                                             /* 主机采集数据       */
		data <<= 1;                                                              /* 空出最低位接受     */
		if(IIC_SDA_R == 1)
			data |= 1;
		Delay_Us(1);                                                             /* 给主机读取数据时间 */
	}
	IIC_SCK_W_0;                                                                 /* 为下一步操作做准备 */
	Iic_Send_Ack(ack);                                                           /* 主机发送应答信号   */
	
	return data;
}
